Initalizing Bilstm Host Model--------------------------------
9
DEBUG: Loading checkpoint model!
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 1784)]       0           []                               
                                                                                                  
 input_2 (InputLayer)           [(None, 1784)]       0           []                               
                                                                                                  
 embedding (Embedding)          (None, 1784, 20)     560         ['input_1[0][0]',                
                                                                  'input_2[0][0]']                
                                                                                                  
 lstm (LSTM)                    (None, 1784, 512)    1091584     ['embedding[0][0]',              
                                                                  'embedding[1][0]']              
                                                                                                  
 lstm_1 (LSTM)                  (None, 512)          2099200     ['lstm[0][0]',                   
                                                                  'lstm[1][0]']                   
                                                                                                  
 embed_layer (Concatenate)      (None, 1024)         0           ['lstm_1[0][0]',                 
                                                                  'lstm_1[1][0]']                 
                                                                                                  
 dense (Dense)                  (None, 512)          524800      ['embed_layer[0][0]']            
                                                                                                  
 dense_1 (Dense)                (None, 256)          131328      ['dense[0][0]']                  
                                                                                                  
 dense_2 (Dense)                (None, 128)          32896       ['dense_1[0][0]']                
                                                                                                  
 dense_3 (Dense)                (None, 64)           8256        ['dense_2[0][0]']                
                                                                                                  
 dense_4 (Dense)                (None, 9)            585         ['dense_3[0][0]']                
                                                                                                  
==================================================================================================
Total params: 3,889,209
Trainable params: 697,865
Non-trainable params: 3,191,344
__________________________________________________________________________________________________
DEBUG: Testing start

 1/10 [==>...........................] - ETA: 1:31
 2/10 [=====>........................] - ETA: 38s 
 3/10 [========>.....................] - ETA: 42s
 4/10 [===========>..................] - ETA: 38s
 5/10 [==============>...............] - ETA: 33s
 6/10 [=================>............] - ETA: 27s
 7/10 [====================>.........] - ETA: 20s
 8/10 [=======================>......] - ETA: 13s
 9/10 [==========================>...] - ETA: 7s 
10/10 [==============================] - ETA: 0s
10/10 [==============================] - 73s 7s/step
AUROC per class:  {'not-in-dictionary': 0.8022587805196502, 'HEV1': 0.9274647887323944, 'HEV2': 0.2002760601620767, 'HEV3': 0.33266597363929207, 'HEV3ra': 0.4026860212955473, 'HEV4': 0.8020173586676049, 'HEV5': 0.9741965751817968, 'HEV6': 0.9579843860894252, 'HEV7': 0.2644001163789127}
Accuracy per class:  {'not-in-dictionary': 0.9813084112149533, 'HEV1': 0.989247311827957, 'HEV2': 0.5, 'HEV3': 0.9862857142857143, 'HEV3ra': 0.9, 'HEV4': 0.9856115107913669, 'HEV5': 0.3333333333333333, 'HEV6': 0.3333333333333333, 'HEV7': 0.7647058823529411}
Frequency of prediction by model per class:  {'not-in-dictionary': 0.07514044943820225, 'HEV1': 0.06460674157303371, 'HEV2': 0.0028089887640449437, 'HEV3': 0.6081460674157303, 'HEV3ra': 0.04002808988764045, 'HEV4': 0.19452247191011235, 'HEV5': 0.002106741573033708, 'HEV6': 0.002106741573033708, 'HEV7': 0.010533707865168539}
Frequency by dataset per class:  {'not-in-dictionary': 0.07373595505617977, 'HEV1': 0.06530898876404495, 'HEV2': 0.0035112359550561797, 'HEV3': 0.6123595505617978, 'HEV3ra': 0.04002808988764045, 'HEV4': 0.1931179775280899, 'HEV5': 0.0007022471910112359, 'HEV6': 0.0007022471910112359, 'HEV7': 0.010533707865168539}
Overall accuracy:  0.9873595505617978
