Initalizing Bilstm Host Model--------------------------------
9
DEBUG: Loading checkpoint model!
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 1784)]       0           []                               
                                                                                                  
 input_2 (InputLayer)           [(None, 1784)]       0           []                               
                                                                                                  
 embedding (Embedding)          (None, 1784, 20)     560         ['input_1[0][0]',                
                                                                  'input_2[0][0]']                
                                                                                                  
 lstm (LSTM)                    (None, 1784, 512)    1091584     ['embedding[0][0]',              
                                                                  'embedding[1][0]']              
                                                                                                  
 lstm_1 (LSTM)                  (None, 512)          2099200     ['lstm[0][0]',                   
                                                                  'lstm[1][0]']                   
                                                                                                  
 embed_layer (Concatenate)      (None, 1024)         0           ['lstm_1[0][0]',                 
                                                                  'lstm_1[1][0]']                 
                                                                                                  
 dense (Dense)                  (None, 512)          524800      ['embed_layer[0][0]']            
                                                                                                  
 dense_1 (Dense)                (None, 256)          131328      ['dense[0][0]']                  
                                                                                                  
 dense_2 (Dense)                (None, 128)          32896       ['dense_1[0][0]']                
                                                                                                  
 dense_3 (Dense)                (None, 64)           8256        ['dense_2[0][0]']                
                                                                                                  
 dense_4 (Dense)                (None, 9)            585         ['dense_3[0][0]']                
                                                                                                  
==================================================================================================
Total params: 3,889,209
Trainable params: 3,889,209
Non-trainable params: 0
__________________________________________________________________________________________________
DEBUG: Testing start

 1/10 [==>...........................] - ETA: 2:56
 2/10 [=====>........................] - ETA: 33s 
 3/10 [========>.....................] - ETA: 37s
 4/10 [===========>..................] - ETA: 34s
 5/10 [==============>...............] - ETA: 29s
 6/10 [=================>............] - ETA: 24s
 7/10 [====================>.........] - ETA: 18s
 8/10 [=======================>......] - ETA: 12s
 9/10 [==========================>...] - ETA: 6s 
10/10 [==============================] - ETA: 0s
10/10 [==============================] - 75s 6s/step
AUROC per class:  {'not-in-dictionary': 0.5881152892022457, 'HEV1': 0.6758802816901408, 'HEV2': 0.2039979057504946, 'HEV3': 0.4407910779142443, 'HEV3ra': 0.15598217292639094, 'HEV4': 0.8174994135585268, 'HEV5': 0.5944170771756978, 'HEV6': 0.6445233025786611, 'HEV7': 0.5580226938879782}
Accuracy per class:  {'not-in-dictionary': 0.675, 'HEV1': 0.822429906542056, 'HEV2': 0.25, 'HEV3': 0.8980891719745223, 'HEV3ra': 0.208955223880597, 'HEV4': 0.8566666666666667, 'HEV5': 0.0, 'HEV6': 0.0, 'HEV7': 0.0}
Frequency of prediction by model per class:  {'not-in-dictionary': 0.07514044943820225, 'HEV1': 0.06460674157303371, 'HEV2': 0.0028089887640449437, 'HEV3': 0.6081460674157303, 'HEV3ra': 0.04002808988764045, 'HEV4': 0.19452247191011235, 'HEV5': 0.002106741573033708, 'HEV6': 0.002106741573033708, 'HEV7': 0.010533707865168539}
Frequency by dataset per class:  {'not-in-dictionary': 0.06601123595505617, 'HEV1': 0.0723314606741573, 'HEV2': 0.0007022471910112359, 'HEV3': 0.6474719101123596, 'HEV3ra': 0.016853932584269662, 'HEV4': 0.19662921348314608, 'HEV5': 0.0, 'HEV6': 0.0, 'HEV7': 0.0}
Overall accuracy:  0.9037921348314607
